In [1]:
import numpy as np
import pandas as pd

In [2]:
dataset = pd.read_csv('https://raw.githubusercontent.com/ardhiraka/PFDS_sources/master/nbaallelo.csv')

In [3]:
dataset.head()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN

In [4]:
dataset.head(10)

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
0,1,194611010TRH,NBA,0,1947,11/1/1946,1,0,TRH,Huskies,...,40.294830,NYK,Knicks,68,1300.0000,1306.7233,H,L,0.640065,NaN
1,1,194611010TRH,NBA,1,1947,11/1/1946,1,0,NYK,Knicks,...,41.705170,TRH,Huskies,66,1300.0000,1293.2767,A,W,0.359935,NaN
2,2,194611020CHS,NBA,0,1947,11/2/1946,1,0,CHS,Stags,...,42.012257,NYK,Knicks,47,1306.7233,1297.0712,H,W,0.631101,NaN
3,2,194611020CHS,NBA,1,1947,11/2/1946,2,0,NYK,Knicks,...,40.692783,CHS,Stags,63,1300.0000,1309.6521,A,L,0.368899,NaN
4,3,194611020DTF,NBA,0,1947,11/2/1946,1,0,DTF,Falcons,...,38.864048,WSC,Capitols,50,1300.0000,1320.3811,H,L,0.640065,NaN
5,3,194611020DTF,NBA,1,1947,11/2/1946,1,0,WSC,Capitols,...,43.135952,DTF,Falcons,33,1300.0000,1279.6189,A,W,0.359935,NaN
6,4,194611020PRO,NBA,1,1947,11/2/1946,1,0,BOS,Celtics,...,40.459381,PRO,Steamrollers,59,1300.0000,1305.1542,A,L,0.359935,NaN
7,4,194611020PRO,NBA,0,1947,11/2/1946,1,0,PRO,Steamrollers,...,41.540619,BOS,Celtics,53,1300.0000,1294.8458,H,W,0.640065,NaN
8,5,194611020STB,NBA,1,1947,11/2/1946,1,0,PIT,Ironmen,...,40.507980,STB,Bombers,56,1300.0000,1304.6908,A,L,0.359935,NaN
9,5,194611020STB,NBA,0,1947,11/2/1946,1,0,STB,Bombers,...,41.492020,PIT,Ironmen,51,1300.0000,1295.3092,H,W,0.640065,NaN

In [5]:
dataset.tail()

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
126309,63155,201506110CLE,NBA,0,2015,6/11/2015,100,1,CLE,Cavaliers,...,60.309792,GSW,Warriors,103,1790.9591,1809.9791,H,L,0.546572,NaN
126310,63156,201506140GSW,NBA,0,2015,6/14/2015,102,1,GSW,Warriors,...,68.013329,CLE,Cavaliers,91,1704.3949,1700.7391,H,W,0.765565,NaN
126311,63156,201506140GSW,NBA,1,2015,6/14/2015,101,1,CLE,Cavaliers,...,60.010067,GSW,Warriors,104,1809.9791,1813.6349,A,L,0.234435,NaN
126312,63157,201506170CLE,NBA,0,2015,6/16/2015,102,1,CLE,Cavaliers,...,59.290245,GSW,Warriors,105,1813.6349,1822.2881,H,L,0.481450,NaN
126313,63157,201506170CLE,NBA,1,2015,6/16/2015,103,1,GSW,Warriors,...,68.519516,CLE,Cavaliers,97,1700.7391,1692.0859,A,W,0.518550,NaN

In [6]:
len(dataset)

126314

In [7]:
dataset.shape

(126314, 23)

In [9]:
dataset.gameorder

0             1
1             1
2             2
3             2
4             3
          ...
126309    63155
126310    63156
126311    63156
126312    63157
126313    63157
Name: gameorder, Length: 126314, dtype: int64

In [11]:
dataset['gameorder']

0             1
1             1
2             2
3             2
4             3
          ...
126309    63155
126310    63156
126311    63156
126312    63157
126313    63157
Name: gameorder, Length: 126314, dtype: int64

In [15]:
dataset[['gameorder', 'fran_id']]

        gameorder    fran_id
0               1    Huskies
1               1     Knicks
2               2      Stags
3               2     Knicks
4               3    Falcons
...           ...        ...
126309      63155  Cavaliers
126310      63156   Warriors
126311      63156  Cavaliers
126312      63157  Cavaliers
126313      63157   Warriors

[126314 rows x 2 columns]

In [16]:
dataset['gameorder'][:5]

0    1
1    1
2    2
3    2
4    3
Name: gameorder, dtype: int64

In [17]:
dataset[['gameorder', 'fran_id']][:10]

   gameorder       fran_id
0          1       Huskies
1          1        Knicks
2          2         Stags
3          2        Knicks
4          3       Falcons
5          3      Capitols
6          4       Celtics
7          4  Steamrollers
8          5       Ironmen
9          5       Bombers

In [18]:
dataset.iloc[[99, 100, 101]]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,...,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes
99,50,194611250PIT,NBA,0,1947,11/25/1946,10,0,PIT,Ironmen,...,37.327347,NYK,Knicks,62,1309.9252,1327.9469,H,L,0.603523,NaN
100,51,194611260DTF,NBA,0,1947,11/26/1946,11,0,DTF,Falcons,...,42.861538,CLR,Rebels,46,1311.4692,1300.3143,H,W,0.633588,NaN
101,51,194611260DTF,NBA,1,1947,11/26/1946,8,0,CLR,Rebels,...,41.032970,DTF,Falcons,66,1306.6039,1317.7588,A,L,0.366412,NaN

In [21]:
a = pd.Series(['jakarta', 'bogor', 'bekasi'])
a

0    jakarta
1      bogor
2     bekasi
dtype: object

In [24]:
b = pd.Series([7, 9, 11])
b

0     7
1     9
2    11
dtype: int64

In [25]:
c = {'a': 3, 'b': 5, 'c': 13}

In [27]:
dengan_indeks = pd.Series(c)
dengan_indeks

a     3
b     5
c    13
dtype: int64

In [29]:
dengan_indeks.iloc[0]

3

In [30]:
dengan_indeks.loc['c']

13

In [35]:
genap = pd.Series([0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20])

In [36]:
genap

0      0
1      2
2      4
3      6
4      8
5     10
6     12
7     14
8     16
9     18
10    20
dtype: int64

In [37]:
d = np.arange(0,21,2)
deret_genap = pd.Series(d)
deret_genap

0      0
1      2
2      4
3      6
4      8
5     10
6     12
7     14
8     16
9     18
10    20
dtype: int32

In [38]:
deret_genap.sum()

110

In [39]:
pd.Series([2, 1, 3, 2]).unique()

array([2, 1, 3], dtype=int64)

In [40]:
data_untuk_dengan_indeks = {'a': 3, 'b': 5, 'c': 13}
data_dengan_indeks = pd.Series(data_untuk_dengan_indeks, ['b', 'c'], dtype=np.int32)
data_dengan_indeks

b     5
c    13
dtype: int32

In [41]:
pd.Series([87.4, 56.9]).astype('int32')

0    87
1    56
dtype: int32

In [42]:
kota_ds = pd.DataFrame({'kota': ['jakarta', 'bandung', 'semarang'], 'populasi': [10, 6, 3]})
kota_ds

       kota  populasi
0   jakarta        10
1   bandung         6
2  semarang         3

In [46]:
kota_ds = pd.DataFrame({'kota': ['jakarta', 'bandung', 'semarang'], 'populasi': [10, 6, 3]}, index = ['a', 'b', 'c'])
kota_ds

       kota  populasi
a   jakarta        10
b   bandung         6
c  semarang         3

In [47]:
kota_ds[kota_ds['populasi'] < 10]

       kota  populasi
b   bandung         6
c  semarang         3

In [50]:
kota_ds['walikota'] = pd.Series(['Budi', 'Susi', 'Joko'], index = ['a', 'b', 'c'])

In [51]:
kota_ds

       kota  populasi walikota
a   jakarta        10     Budi
b   bandung         6     Susi
c  semarang         3     Joko

In [52]:
kota_ds.append({'kota': 'manado', 'populasi': 2, 'walikota': 'Nila'}, ignore_index=True)

       kota  populasi walikota
0   jakarta        10     Budi
1   bandung         6     Susi
2  semarang         3     Joko
3    manado         2     Nila

In [53]:
kota_ds

       kota  populasi walikota
a   jakarta        10     Budi
b   bandung         6     Susi
c  semarang         3     Joko

In [54]:
baris_manado = pd.Series({'kota': 'manado', 'populasi': 2, 'walikota': 'Nila'}, name='d')
baris_manado

kota        manado
populasi         2
walikota      Nila
Name: d, dtype: object

In [55]:
kota_ds.append(baris_manado)

       kota  populasi walikota
a   jakarta        10     Budi
b   bandung         6     Susi
c  semarang         3     Joko
d    manado         2     Nila

In [57]:
kota_ds = kota_ds.append(baris_manado)

In [58]:
kota_ds

       kota  populasi walikota
a   jakarta        10     Budi
b   bandung         6     Susi
c  semarang         3     Joko
d    manado         2     Nila

In [59]:
d

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18, 20])

In [60]:
e

NameError: name 'e' is not defined

In [61]:
e = pd.DataFrame({'a': [1, 3, 4], 'b':[4, 4, 4,], 'c':[8, 2, 1]})
e

   a  b  c
0  1  4  8
1  3  4  2
2  4  4  1

In [62]:
e.sum()

a     8
b    12
c    11
dtype: int64

In [63]:
e.sum(axis=1)

0    13
1     9
2     9
dtype: int64

In [64]:
e.loc[1:3, ['a', 'b']]

   a  b
1  3  4
2  4  4

In [66]:
e.loc[0:2, ['a', 'b']]

   a  b
0  1  4
1  3  4
2  4  4

In [72]:
kota_ds.loc['c':'d', ['kota', 'populasi', 'walikota']]

       kota  populasi walikota
c  semarang         3     Joko
d    manado         2     Nila

In [73]:
kota_ds.loc['c', ['kota', 'walikota']]

kota        semarang
walikota        Joko
Name: c, dtype: object

In [74]:
kota_ds.loc['d', ['kota', 'populasi']]

kota        manado
populasi         2
Name: d, dtype: object

In [75]:
kota_ds [kota_ds['kota'] == 'semarang'] ['walikota']

c    Joko
Name: walikota, dtype: object

In [76]:
kota_ds [kota_ds['kota'] == 'manado'] ['populasi']

d    2
Name: populasi, dtype: int64

In [77]:
kota_ds [(kota_ds['walikota'] == 'Nila') & (kota_ds['populasi'] < 9)] ['populasi']

d    2
Name: populasi, dtype: int64

In [78]:
kota_ds['jenis_kelamin'] = pd.Series(['L', 'P', 'L', 'P'], ['a', 'b', 'c', 'd'])

In [79]:
kota_ds

       kota  populasi walikota jenis_kelamin
a   jakarta        10     Budi             L
b   bandung         6     Susi             P
c  semarang         3     Joko             L
d    manado         2     Nila             P

In [80]:
kota_ds.groupby(['jenis_kelamin']) ['populasi'].sum()

jenis_kelamin
L    13
P     8
Name: populasi, dtype: int64

In [81]:
kota_ds [kota_ds['kota'] != 'manado']

       kota  populasi walikota jenis_kelamin
a   jakarta        10     Budi             L
b   bandung         6     Susi             P
c  semarang         3     Joko             L

In [82]:
kota_ds [kota_ds['kota'] != 'manado'].groupby(['jenis_kelamin']) ['populasi'].sum()

jenis_kelamin
L    13
P     6
Name: populasi, dtype: int64

In [83]:
kota_ds [kota_ds['kota'] != 'manado'].groupby(['jenis_kelamin']) ['walikota'].count()

jenis_kelamin
L    2
P    1
Name: walikota, dtype: int64

In [84]:
kota_ds['suhu'] = pd.Series([30, None, None, 29], ['a', 'b', 'c', 'd'])

In [85]:
kota_ds

       kota  populasi walikota jenis_kelamin  suhu
a   jakarta        10     Budi             L  30.0
b   bandung         6     Susi             P   NaN
c  semarang         3     Joko             L   NaN
d    manado         2     Nila             P  29.0

In [86]:
kota_ds.dropna()

      kota  populasi walikota jenis_kelamin  suhu
a  jakarta        10     Budi             L  30.0
d   manado         2     Nila             P  29.0

In [87]:
kota_ds.fillna(28)

       kota  populasi walikota jenis_kelamin  suhu
a   jakarta        10     Budi             L  30.0
b   bandung         6     Susi             P  28.0
c  semarang         3     Joko             L  28.0
d    manado         2     Nila             P  29.0

In [88]:
kota_ds.describe()

        populasi       suhu
count   4.000000   2.000000
mean    5.250000  29.500000
std     3.593976   0.707107
min     2.000000  29.000000
25%     2.750000  29.250000
50%     4.500000  29.500000
75%     7.000000  29.750000
max    10.000000  30.000000